(function () {
  'use strict';

  const FOODS = [
    { month: 4, items: [[1, '十倍粥'], [2, '米湯'], [3, '小米粥'], [4, '藜麥'], [5, '紅藜'], [6, '紅蘿蔔'], [7, '花椰菜'], [8, '高麗菜'], [9, '南瓜'], [10, '地瓜'], [11, '地瓜葉'], [12, '青江菜'], [13, '小松菜'], [14, '油菜'], [15, '蘋果'], [16, '梨子'], [17, '莧菜'], [18, '大白菜'], [19, '小白菜'], [20, '大陸妹'], [21, '美生菜'], [22, '芥蘭菜'], [23, '空心菜'], [24, '冬瓜'], [24, '甜椒'], [25, '火龍果'], [26, '白蘿蔔'], [26, '葡萄'], [26, '馬鈴薯'], [27, '西洋梨'], [28, '豆薯'], [28, '洋蔥'], [29, '酪梨'], [30, '香蕉']] },
    { month: 5, items: [[30, '玉米筍'], [31, '玉米'], [32, '黑木耳'], [32, '蘆筍'], [33, '柿子'], [33, '皇宮菜'], [34, '豌豆苗'], [34, '蓮霧'], [35, '綠豆芽']] },
    { month: 6, items: [[36, '蔬菜高湯'], [37, '青蔥'], [38, '薑'], [39, '大蒜'], [40, '木瓜'], [41, '甜菜根'], [42, '米豆'], [42, '芭樂'], [43, '菠菜'], [43, '香瓜'], [44, '蜜李'], [44, '茭白筍'], [45, '茄子'], [46, '蕃茄']] },
    { month: 7, items: [[48, '糙米粥'], [49, '菱角'], [49, '草莓'], [50, '毛豆'], [51, '皇帝豆'], [51, '秋葵'], [52, '芹菜'], [52, '山芹菜'], [53, '韭黃'], [53, '韭菜'], [54, '豌豆仁'], [55, '絲瓜'], [56, '苦瓜'], [57, '瓠瓜'], [57, '大黃瓜'], [58, '小黃瓜'], [59, '雞肉'], [60, '魚肉'], [61, '豬肉'], [62, '牛肉'], [63, '豆腐'], [64, '蛋黃'], [65, '雞高湯'], [66, '魚高湯'], [66, '豬高湯'], [67, '蒜頭雞湯']] },
    { month: 8, items: [[68, '紅豆粥'], [69, '桂圓粥'], [70, '紫米粥'], [71, '黑米粥'], [72, '燕麥粥'], [72, '紅棗粥'], [73, '蓮子粥'], [73, '蓮藕'], [74, '山藥'], [75, '黑芝麻'], [76, '白木耳'], [77, '枸杞']] },
    { month: 9, items: [[79, '海帶芽粥'], [79, '昆布高湯'], [79, '蘑菇高湯'], [80, '蘑菇'], [81, '鮮香菇'], [82, '金針菇'], [83, '杏鮑菇'], [83, '鴻喜菇'], [84, '起司']] },
    { month: 10, items: [[87, '核桃粥'], [88, '雪蓮子粥'], [88, '百合粥'], [89, '芋頭'], [90, '栗子'], [91, '竹筍'], [92, '牛蒡'], [92, '蝦子'], [93, '鳳梨'], [94, '芒果'], [94, '水蜜桃'], [95, '檸檬'], [95, '奇異果'], [96, '柳丁']] }
  ];

  if (typeof module === 'object' && module.exports) {
    module.exports = FOODS;
  } else {
    window.babyfoodie.FOODS = FOODS;
  }
})();
